# encoding: utf-8
module Jpay
  module Errors
    IDS = {
      '-32' => 'مبلغ وارد شده مطابقت ندارد',
      '-31' => 'پرداخت ناموفق',
      '-30' => 'پرداخت نامعتبر',
      '-29' => 'لینک بازگشت تعیین نشده است',
      '-27' => 'IP شما مسدود شده است',
      '-26' => 'درگاه غیر فعال شده است',
      '-24' => 'مبلغ نامعتبر است',
      '-23' => 'مبلغ زیاد است',
      '-22' => 'مبلغ باید بیشتر از 100 تومان باشد',
      '-21' => 'IP برای درگاه نامعتبر است',
      '-20' => 'API نامعتبر است',
      '-6'  => 'خطای ارتباط با بانک',
      '-9'  => 'خطای سیستمی',
    }
  end
end